Revit 2025 API
StructuralWallUsage Enumeration
 Represents the structural usage of a wall.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum StructuralWallUsage
Public Enumeration StructuralWallUsage
public enum class StructuralWallUsage
type StructuralWallUsage
Members
Member name | Value | Description
NonBearing | 0 |  Structural usage is non-bearing.
Bearing | 1 |  Structural usage is bearing.
Shear | 2 |  Structural usage is shear.
Combined | 3 |  Structural usage is combined.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace